RIET/src/Documents/увВопрос/увВопрос.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>увВопрос</name>
  <posting>Deny</posting>
  <attributes>
    <name>Вопрос</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответ</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Спросил</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответил</name>
    <type>
      <types>CatalogRef.ГруппыПользователей</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Утвердил</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУтверждения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПринятияКРассмотрению</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтвета</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Утверждено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Отвечено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПринятоКРассмотрению</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветПринят</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПринятияОтвета</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.увСтруктурныеПодразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Важность</name>
    <type>
      <types>EnumRef.увВажность</types>
    </type>
  </attributes>
  <attributes>
    <name>ТемаВопроса</name>
    <type>
      <types>CatalogRef.увТемыВопросовИЗаявок</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуемаяДатаОтвета</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтправлятьСрочно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Отправлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВключатьВFAQ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.увСтатусыВопросов</types>
    </type>
  </attributes>
  <attributes>
    <name>Сторона</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СсылкиНаОбъекты</name>
    <attributes>
      <name>СсылкаНаОбъект</name>
      <type>
        <types>String</types>
        <types>AnyRef</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>История</name>
    <attributes>
      <name>Статус</name>
      <type>
        <types>EnumRef.увСтатусыВопросов</types>
      </type>
    </attributes>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Текст</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

RIET/src/InformationRegisters/КонтактнаяИнформация/КонтактнаяИнформация.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КонтактнаяИнформация</name>
  <resources>
    <name>Представление</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Поле1</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле2</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле3</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле4</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле5</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле6</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле7</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле8</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле9</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле10</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ЗначениеПоУмолчанию</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>ПользовательЛичногоКонтакта</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>CatalogRef.КонтактныеЛица</types>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыКонтактнойИнформации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Вид</name>
    <type>
      <types>String</types>
      <types>CatalogRef.ВидыКонтактнойИнформации</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

RIET/src/Enums/ТипыКонтактнойИнформации/ТипыКонтактнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыКонтактнойИнформации</name>
  <enumValues>
    <name>Адрес</name>
  </enumValues>
  <enumValues>
    <name>Телефон</name>
  </enumValues>
  <enumValues>
    <name>АдресЭлектроннойПочты</name>
  </enumValues>
  <enumValues>
    <name>ВебСтраница</name>
  </enumValues>
  <enumValues>
    <name>Факс</name>
  </enumValues>
  <enumValues>
    <name>Другое</name>
  </enumValues>
  <enumValues>
    <name>Skype</name>
  </enumValues>
</mdclass:Enum>

RIET/src/Catalogs/ВидыКонтактнойИнформации/ВидыКонтактнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыКонтактнойИнформации</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>СправочникКонтактныеЛица</name>
      <description>Контактная информация справочника &quot;Контактные лица&quot;</description>
    </items>
    <items>
      <name>СправочникКонтрагенты</name>
      <description>Контактная информация справочника &quot;Контрагенты&quot;</description>
    </items>
    <items>
      <name>СправочникОрганизации</name>
      <description>Контактная информация справочника &quot;Организации&quot;</description>
    </items>
    <items>
      <name>СправочникОсновныеСредства</name>
      <description>Контактная информация справочника &quot;Основные средства&quot;</description>
    </items>
    <items>
      <name>СправочникПодразделенияОрганизаций</name>
      <description>Контактная информация справочника &quot;Подразделения организаций&quot;</description>
    </items>
    <items>
      <name>СправочникПолучателиРассылокОтчетов</name>
      <description>Контактная информация справочника &quot;Получатели рассылок отчетов&quot;</description>
    </items>
    <items>
      <name>СправочникПользователи</name>
      <description>Контактная информация справочника &quot;Пользователи&quot;</description>
    </items>
    <items>
      <name>СправочникФизическиеЛица</name>
      <description>Контактная информация справочника &quot;Физические лица&quot;</description>
    </items>
    <items>
      <name>ИнформАдресФизЛица</name>
      <description>Адрес для информирования физ. лица</description>
    </items>
    <items>
      <name>ДляИнвойсаАдресКонтрагента</name>
      <description>Адрес контрагента для инвойса</description>
    </items>
    <items>
      <name>АнглийскийАдресКонтрагента</name>
      <description>Адрес контрагента по-английски</description>
    </items>
    <items>
      <name>ДляИнвойсаАдресОрганизации</name>
      <description>Адрес организации для инвойса</description>
    </items>
    <items>
      <name>АнглийскийАдресОрганизации</name>
      <description>Адрес организации по-английски</description>
    </items>
    <items>
      <name>ЮрАдресФизЛица</name>
      <description>Адрес по прописке физ. лица</description>
    </items>
    <items>
      <name>ФактАдресФизЛица</name>
      <description>Адрес проживания физ. лица</description>
    </items>
    <items>
      <name>ИнострАдресФизЛица</name>
      <description>Адрес физ. лица за пределами РФ </description>
    </items>
    <items>
      <name>АдресОрганизацииПочтовый</name>
      <description>Почтовый адрес организации</description>
    </items>
    <items>
      <name>СлужебныйАдресЭлектроннойПочтыПользователя</name>
      <description>Служебный адрес электронной почты пользователя</description>
    </items>
    <items>
      <name>ТелефонФизЛица</name>
      <description>Телефон физ. лица</description>
    </items>
  </predefined>
  <attributes>
    <name>АдресТолькоРоссийский</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОбъектаКонтактнойИнформации</name>
    <type>
      <types>EnumRef.ВидыОбъектовКонтактнойИнформации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВключатьСтрануВПредставление</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретитьРедактированиеПользователем</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапрещатьВводНекорректного</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МожноИзменятьСпособРедактирования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбязательноеЗаполнение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подсказка</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьКорректность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьПоФИАС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьВводНесколькихЗначений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РедактированиеТолькоВДиалоге</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СкрыватьНеактуальныеАдреса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТелефонCДобавочнымНомером</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыКонтактнойИнформации</types>
    </type>
  </attributes>
  <attributes>
    <name>УказыватьОКТМО</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МногострочноеПоле</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранитьИсториюИзменений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

RIET/src/Documents/увВопрос/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ДОКУМЕНТА

// Процедура - обработчик события "ПриУстановкеНовогоНомера" документа.
Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	Префикс = Константы.увПрефиксБазы.Получить();
	
КонецПроцедуры

// Процедура - обработчик события "ПередЗаписью" документа
//
Процедура ПередЗаписью(Отказ)
	
	
#Если Клиент Тогда
	Если ОтправлятьСрочно и НЕ Отправлен Тогда
		ОтветНаВопрос = Вопрос("Отправить вопрос по email?",РежимДиалогаВопрос.ДаНет);
		Если ОтветНаВопрос = КодВозвратаДиалога.Да Тогда
			//ИнтернетПочта = Новый ИнтернетПочта();
			//Профиль = Новый ИнтернетПочтовыйПрофиль();
			//ПрофильОтправки = Константы.увОсновнойПочтовыйПрофиль.Получить();
			//Если ПрофильОтправки.Пустая() Тогда
			//	ОтправлятьСрочно = Ложь;
			//	Сообщить("Не указан основной почтовый профиль. Невозможно отправить вопрос.");
			//	Возврат;
			//КонецЕсли;
			//Профиль.АдресСервераPOP3 = ПрофильОтправки.АдресСервераPOP3;
			//Профиль.АдресСервераSMTP = ПрофильОтправки.АдресСервераSMTP;
			//Профиль.Пароль = ПрофильОтправки.Пароль;
			//Профиль.ПарольSMTP = ПрофильОтправки.ПарольSMTP;
			//Профиль.Пользователь = ПрофильОтправки.Пользователь;
			//Профиль.ПользовательSMTP = ПрофильОтправки.ПользовательSMTP;
			//Профиль.ПортPOP3 = ПрофильОтправки.ПортPOP3;
			//Профиль.ПортSMTP = ПрофильОтправки.ПортSMTP;
			//Профиль.ВремяОжидания = 40;
			//
			//Письмо = Новый ИнтернетПочтовоеСообщение();
			//ОтборАдреса = Новый Структура("Объект,Тип,Вид",Ответил,Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты, Справочники.ВидыКонтактнойИнформации.СлужебныйАдресЭлектроннойПочтыПользователя );
			//АдресПолучателя = РегистрыСведений.КонтактнаяИнформация.Получить(ОтборАдреса);
			//Если АдресПолучателя.Представление = "" Тогда
			//	ОтправлятьСрочно = Ложь;
			//	Сообщить("Не указан адрес электронной почты пользователя "+Ответил+". Невозможно отправить вопрос.");
			//	Возврат;
			//КонецЕсли;
			//
			//Письмо.Получатели.Добавить(АдресПолучателя);
			//Письмо.ИмяОтправителя = Профиль.Пользователь;
			//Письмо.Тема = "Срочный вопрос от " + Спросил + ", "+Константы.увПрефиксБазы.Получить()+", " + ТекущаяДата();
			//Письмо.Отправитель = ПрофильОтправки.АдресОтправителя;
			//Строка = "Вопрос от " + Спросил + Символы.ПС + "Требуемая дата ответа " + ТребуемаяДатаОтвета + Символы.ПС + "Тема вопроса: " + ТемаВопроса + Символы.ПС + Вопрос;
			//Письмо.Тексты.Добавить(Строка,);
			//
			//Попытка
			//	ИнтернетПочта.Подключиться(Профиль);
			//	ИнтернетПочта.Послать(Письмо, ОбработкаТекстаИнтернетПочтовогоСообщения.НеОбрабатывать);
			//	ИнтернетПочта.Отключиться();
			//	Отправлен = Истина;
			//Исключение
			//	Предупреждение("Не удалось отправить файл выгрузки по электронной почте " + ПрофильОтправки.АдресОтправителя + " " + ОписаниеОшибки());
			//КонецПопытки;
			//Попытка
				//определяем адрес человека, которому задан вопрос
				ОтборАдреса = Новый Структура("Объект,Тип,Вид",Ответил,Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты, Справочники.ВидыКонтактнойИнформации.СлужебныйАдресЭлектроннойПочтыПользователя );
				АдресПолучателя = РегистрыСведений.КонтактнаяИнформация.Получить(ОтборАдреса);
				Если АдресПолучателя.Представление = "" Тогда
					ОтправлятьСрочно = Ложь;
					Сообщить("Не указан адрес электронной почты пользователя "+Ответил+". Невозможно отправить вопрос.");
					Возврат;
				КонецЕсли;
				Тема = "Срочный вопрос от " + Спросил + ", "+Константы.увПрефиксБазы.Получить()+", " + ТекущаяДата();
				Тело = "Вопрос от " + Спросил + Символы.ПС + "Требуемая дата ответа " + ТребуемаяДатаОтвета + Символы.ПС + "Тема вопроса: " + ТемаВопроса + Символы.ПС + Вопрос;
				ПрофильОтправки = Константы.увОсновнойПочтовыйПрофиль.Получить();
				Если ПрофильОтправки.Пустая() Тогда
					ОтправлятьСрочно = Ложь;
					Сообщить("Не указан основной почтовый профиль. Невозможно отправить вопрос.");
					Возврат;
				КонецЕсли;
				
				Если SalesBook.ОтправитьПочтуSSL(ПрофильОтправки, АдресПолучателя.Представление, Тема, Тело) Тогда
					Отправлен = Истина;
				КонецЕсли;
				
			//Исключение
			//	Сообщить(ОписаниеОшибки());
			//	Предупреждение("Не удалось отправить файл выгрузки по электронной почте " + ПрофильОтправки.АдресОтправителя);
			//КонецПопытки;
		КонецЕсли;
	КонецЕсли;             			
#КонецЕсли

	//проверим заплнение необходимых полей
	Если Не ЗначениеЗаполнено(Дата) Тогда	
		Сообщить("Не заполнено поле: Дата");
		Отказ = Истина;
	ИначеЕсли Не ЗначениеЗаполнено(Номер) Тогда	
		Сообщить("Не заполнено поле: Номер");
		Отказ = Истина;
	ИначеЕсли Не ЗначениеЗаполнено(Спросил) Тогда	
		Сообщить("Не заполнено поле: От");
		Отказ = Истина;	
	ИначеЕсли Не ЗначениеЗаполнено(Ответил) Тогда	
		Сообщить("Не заполнено поле: Кому");
		Отказ = Истина;	
	ИначеЕсли Не ЗначениеЗаполнено(ТемаВопроса) Тогда
		Сообщить("Не заполнено поле: Тема вопроса");	
		Отказ = Истина;
	КонецЕсли;
	
	Если Не Отказ И История.Количество()>0 Тогда
		Статус = История[История.Количество()-1].Статус;
	КонецЕсли;

КонецПроцедуры


#Если Клиент Тогда
	// Функция вывода на печать текущего вопроса.
	//
	//Возвращаемое значение - ТабличныйДокумент - содержит табличный документ
	//с выведенным в него вопросом в виде форума.
	Функция ПечататьВопрос() Экспорт
		
		ТабДок=Новый ТабличныйДокумент;
		Макет=ЭтотОбъект.ПолучитьМакет("МакетФорума");
		Запрос=Новый Запрос("ВЫБРАТЬ
		|	увВопросИстория.Статус,
		|	увВопросИстория.Дата,
		|	увВопросИстория.Пользователь,
		|	увВопросИстория.Текст
		|ИЗ
		|	Документ.увВопрос.История КАК увВопросИстория
		|ГДЕ
		|	увВопросИстория.Ссылка = &Ссылка");
		Запрос.УстановитьПараметр("Ссылка",Ссылка);
		ТЗ=Запрос.Выполнить().Выгрузить();
		
		ОбластьЗаголовка=Макет.ПолучитьОбласть("Заголовок");
		ОбластьЗаголовка.Параметры.Номер=Номер;
		ОбластьЗаголовка.Параметры.Дата=Дата;
		ОбластьЗаголовка.Параметры.ТемаВопроса=ТемаВопроса;
		ТабДок.Вывести(ОбластьЗаголовка);
		ОбластьШапки=Макет.ПолучитьОбласть("Шапка");
		ТабДок.Вывести(ОбластьШапки);
		
		ДанныеЗаписи=Макет.ПолучитьОбласть("ДанныеЗаписи");
		МакетВопрос=Макет.ПолучитьОбласть("Вопрос");
		
		Для каждого СтрокаТЗ из ТЗ Цикл
			ДанныеЗаписи.Параметры.Заполнить(СтрокаТЗ);
			ТабДок.Вывести(ДанныеЗаписи);
			Если ЗначениеЗаполнено(СтрокаТЗ.Текст) Тогда
				МакетВопрос.Параметры.Заполнить(СтрокаТЗ);
				ТабДок.Вывести(МакетВопрос);
			КонецЕсли;
		КонецЦикла;	
		ТабДок.ОтображатьСетку = Ложь;
		ТабДок.Защита = Ложь;
		ТабДок.ТолькоПросмотр = Ложь;
		ТабДок.ОтображатьЗаголовки = Ложь;
		ТабДок.ФиксацияСверху = 5;
		Возврат ТабДок;
		
	КонецФункции
#КонецЕсли

//Процедура ПриЗаписи(Отказ)
//	Запрос= Новый Запрос;
//	Запрос.Текст="ВЫБРАТЬ
//	|	ЗадачиПользователя.Ссылка КАК Задача
//	|ИЗ
//	|	Задача.ЗадачиПользователя КАК ЗадачиПользователя
//	|ГДЕ
//	|	ЗадачиПользователя.Выполнена = ЛОЖЬ
//	|	И ЗадачиПользователя.Объект = &ЭтотВопрос";
//	Запрос.УстановитьПараметр("ЭтотВопрос",Ссылка);
//	
//	СписокПользователей=Новый СписокЗначений;
//	Если Сторона=Истина Тогда
//		Если ТипЗнч(Ответил)=Тип("СправочникСсылка.Пользователи") Тогда
//			СписокПользователей.Добавить(Ответил)
//		Иначе
//			Для каждого СтрокаТЧ из Ответил.ПользователиГруппы Цикл
//				СписокПользователей.Добавить(СтрокаТЧ.Пользователь);     	
//			КонецЦикла;
//		КонецЕсли;
//	Иначе
//		СписокПользователей.Добавить(Спросил);
//	КонецЕсли;
//	
//	Выборка=Запрос.Выполнить().Выбрать();
//	Пока Выборка.Следующий() Цикл
//		ЗадачаОбъект=Выборка.Задача.ПолучитьОбъект();
//		ЭлементСписка=СписокПользователей.НайтиПоЗначению(ЗадачаОбъект.Исполнитель);
//		
//		//Нужно определить открытую в текущий момент задачу
//		Если ЗадачаОбъект.Исполнитель=ПараметрыСеанса.ТекущийПользователь Тогда
//			Если не ЭлементСписка=Неопределено Тогда
//				СписокПользователей.Удалить(ЭлементСписка);
//			КонецЕсли;
//			Продолжить;
//		КонецЕсли;
//		
//		Если Не ЭлементСписка=Неопределено Тогда
//			ЗадачаОбъект.Дата=ТекущаяДата();
//			ЗадачаОбъект.Наименование=ТемаВопроса;
//			ЗадачаОбъект.Описание=увМониторСопровождения.ПолучитьТекстВопроса(Ссылка);
//			ЗадачаОбъект.СрокИсполнения=ТребуемаяДатаОтвета;
//			ЗадачаОбъект.СрокОповещения=ТекущаяДата();
//			ЗадачаОбъект.Оповещение=Истина;
//			ЗадачаОбъект.Объект=Ссылка;
//			ЗадачаОбъект.Инициатор=ПараметрыСеанса.ТекущийПользователь;
//			ЗадачаОбъект.Записать();       
//			
//			СписокПользователей.Удалить(ЭлементСписка);
//		Иначе		
//			ЗадачаОбъект.Описание=увМониторСопровождения.ПолучитьТекстВопроса(Ссылка);
//			ЗадачаОбъект.Выполнена=Истина;
//		КонецЕсли;
//		ЗадачаОбъект.Записать();                  		
//	КонецЦикла;
//	
//	Для каждого Пользователь из СписокПользователей Цикл
//			ЗадачаОбъект=Задачи.ЗадачиПользователя.СоздатьЗадачу();
//			ЗадачаОбъект.Дата=ТекущаяДата();
//			ЗадачаОбъект.Наименование=ТемаВопроса;
//			ЗадачаОбъект.Описание=увМониторСопровождения.ПолучитьТекстВопроса(Ссылка);
//			ЗадачаОбъект.СрокИсполнения=ТребуемаяДатаОтвета;
//			ЗадачаОбъект.СрокОповещения=ТекущаяДата();
//			ЗадачаОбъект.Оповещение=Истина;
//			ЗадачаОбъект.Объект=Ссылка;
//			ЗадачаОбъект.Исполнитель=Пользователь.Значение;
//			ЗадачаОбъект.Инициатор=ПараметрыСеанса.ТекущийПользователь;
//			ЗадачаОбъект.Записать();          	
//		КонецЦикла;

//КонецПроцедуры
